Repository: atlas-studios/Session2-G9
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 江逸目光死死锁定那两只真实的拳影，脑海内快速预算对方的攻击轨迹和速度，提前判断，先一步躲避退走，让对方再次砸空。
en_us: Jiang Yi's eyes were firmly locked on to the figures of her two actual fists, as he calculated at quick speed in his brain the opposing party's attack trajectory and speed. As he had already predicted the incoming attacks in advance, he had already taken the action to avoid the attack and retreat backward, allowing the opposing party to hit nothing but air once again.

source: 江逸直接打断他的话，沉着脸警告道：“小奴，你记住，从今天开始你再也不许离开江家大院，否则你就不要认我这个少爷了。”
en_us: Jiang Yi cut her off immediately and warned her, "Xiaonu, you must remember, from today onwards you will never be allowed to leave the Jiang Residence Central Courtyard. Otherwise, you can forget about ever recognizing me as your Young Master anymore."

source: 江逸看到江松如此，有些愧疚的宽慰道：“江松，对不起，我也不是有意的……”
en_us: Seeing Jiang Song's condition, with some regret Jiang Yi tried to console him by saying, "Jiang Song, I'm sorry. I did not mean to do it..."

source: 江逸看到马飞的脸色就知道要坏事了，暗道晦气，今日出门这么没看黄历？恰好遇到了马家的纨绔少爷？这马家和江家是世仇，马家的任何一名纨绔少爷遇到今天这事，肯定都会出手。
en_us: One look at Ma Fei's demeanor told Jiang Yi that things would not go well. He silently cursed his bad luck. Why had he not consulted the almanac today before leaving the house? And to have so coincidentally come across such a wastrel playboy of the Ma Family? With the feud between the Ma and Jiang families, any wastrel descendant in the Ma Family would have chosen to take action against him.

source: 江逸看得砰然心动，这柳长老可是说了爱拿多少拿多少，那不是表明他可以多拿几枚丹药，还可以拿人阶中品、上品的丹药？
en_us: Jiang Yi felt a rush of excitement the more he looked. Elder Liu did say he could take as much as he wanted, so does that not mean that he could take more elixirs, and even take those elixirs of Man-tier medial or even superior grade?

source: 江逸眨了眨眼睛，暗道侥幸，不过看到对方的拳头近在咫尺，他也顾不上多想，下意识的继续运转元力，身形一扭朝旁边躲避，同时双手也继续朝江豹打出的重拳架去。
en_us: Jiang Yi blinked his eyes in disbelief, feeling relieved on the inside. However, seeing the opponent’s fists within mere inches from his face, without thinking too much, he subconsciously continued to circulate his essence force. He moved his body to the side to avoid the attack while shooting both his fists at Jiang Bao.

source: 江逸眸子一下冷了下来，不是因为对方又要他入赘，而是因为这翊龙宇提到了江家。
en_us: Jiang Yi's expression turned icy, not at yet another request for him to marry into the Yi Family, but at Yi Longyu's mention of the Jiang Clan.

source: 江逸眸子内冷意一闪，不过他却没有像昨日那般冒然过去查看，不想再惹事端的话，只能佯装没看到，继续清点草参。
en_us: A chill went down Jiang Yi’s spine. Unlike the day before, however, he did not rashly rush over to check, but rather decided to ignore the noise and instead pretend to not have heard it. He continued counting the medicinal plants around him, lest he faced new problems.

source: 江逸眸子闪烁，脑海一转，突然有个很胆大的想法：“难道是因为我注入了两缕黑色元力，这才炸丹的？剩下两枚不仅没炸，反而由白色变成了黑色？也是因为这两缕黑色元力的缘故？”
en_us: Jiang Yi's eyes flickered as his mind raced, suddenly coming up with a bold idea. What if the exploding elixirs were caused by me inserting two strands of black essence force? Not only did the remaining two pills not explode, their colors changed from white to black? Were these two strands of black essence force also the reason behind it?

source: 江逸眼中恨意一闪，这人他认识，是昨日和江如虎一起偷药，一同殴打他的家族旁系子弟之一，也是江如虎的著名狗腿子。估计这厮以为自己才被打伤，今日应该不会上山，又贪心地跑来多偷点药吧？
en_us: Jiang Yi felt a surge of hatred. He knew this boy. He had stolen medicine with Jiang Ruhu yesterday and was one of the many branch members who ganged up to beat up Jiang Yi. In other words, he was one of Jiang Ruhu’s many infamous lackeys. It seemed likely that this idiot had presumed that Jiang Yi was badly injured in the fight and that he was unlikely to go to the Western Hills. Due to this, he had returned to the plantation fields to steal more medicinal plants.

source: 江逸眼中露出一丝狠色，和春芽交代一声，拔腿就往外狂奔而去。时间紧迫，他也没时间去多想了，只能孤身前往，就算被活活打死他也必须救出江小奴。
en_us: After that, he took to his heels and dashed out. He did not have the luxury of time to think through the matter. All he could do was head out alone. Even if he was beaten to death, he had to save Jiang Xiaonu.

source: 江逸眼中黑光一闪，第一次动用黑色元力，他冷喝一声身子如一道残影般朝前方冲去，双拳幻化成六道残影，将最前方的江顾水笼罩进去。
en_us: Jiang Yi's eyes had a flash of black light. This was his first time utilizing the black essence forces. With a shout, his body was like a phantom dashing forward. His fists produced six phantom afterimages and shrouded Jiang Gushui who was leading the charge.

source: 江逸眼中黑光流转，江如虎的动作一切清晰可见，轻松判断出他攻击的轨迹，融合了一丝黑色元力的拳头长驱直入重重的砸在江如虎的左肩上。
en_us: A black flash circulated within Jiang Yi's eyes, allowing him to clearly and distinctly see Jiang Ruhu's every action. As such, he could easily determine Jiang Ruhu's attack trajectory. His fist, which had merged with a wisp of black essence force, drove straight and smashed heavily into Jiang Ruhu's left shoulder.

source: 江逸眼眸一亮，感激的抱拳一揖，内心也被激起豪气冲天，笑道：“他日若是凌云志，一定不忘小姐的教诲。”
en_us: Jiang Yi's eyes lit up. He cupped his fists raised them in gratitude. A heroic spirit was also aroused and soared highly in his heart. Smiling, he replied, "In the future, should I achieve greatness, I would definitely not forget Young Mistress's teachings and advice."

source: 江逸眼眸一冷，这风月楼他知道，是江家所在东城最大的青楼。他也跟踪过小奴一次，也知道她出去做工就是在风月楼后院帮他们洗衣物床单，换取微薄的银钱。
en_us: Jiang Yi gave a chilly look. He knew about Fengyue Brothel. It was the Jiang Clan's biggest brothel in the East City. He had once followed Xiaonu there and knew that she had been working at the brothel's back kitchen washing their laundry and bedding for a few meager taels of silver.

source: 江逸眼眸一冷，铁拳瞬间收回，却立即变招化作缠丝手抓住江如虎的头发，朝后猛然一拽单腿重重一扫，江如虎肥胖的身躯轰然倒地。
en_us: Jiang Yi let out a stare and instantly withdrew his iron fist, then change into Silk Hands to grasp Jiang Ruhu's hair. He then did a vigorous leg sweep to bring Jiang Ruhu's plump body to the ground.

source: 江逸眼眸一缩，下意识的开口问道：“只是做陪练？不需要其他的？”
en_us: Jiang Yi squinted his eyes and made himself decide to open his mouth to ask, "Do I do exclusively the work of a sparring partner? Do I not need to do anything else for you?"

source: 江逸眼眸一缩，他在江家月例只有一两碎银子，这一两紫金可是一百两银子啊，就算把他卖了也不值十两紫金，这伙人看来是打定主意要留下江小奴了。
en_us: Jiang Yi's pupils contracted. His monthly salary was only worth one tael of tiny silver pieces, but one tael of purple silver was equivalent to one hundred taels of silver! One could not possibly earn ten taels of purple gold even if Jiang Yi was sold off. It was clear that this guy had set his mind on ensuring Jiang Xiaonu stayed behind.

source: 江逸眼眸死死盯着对方的双手，却发现根本无法预算对方的攻击轨迹，因为对方最少可以随意变招三四次。
en_us: Jiang Yi locked his gaze on his opponent's hands, but to his dismay, he was unable to predict where the attacks would come from, seeing how Yi Longyu could easily change his technique at least three to four times in an instant.

source: 江逸眼睛看着管事，余光却偷偷观察那马家少爷的反应，漠然说道：“钱我带来了，令牌给我吧。”
en_us: Jiang Yi looked at the housekeeper, while out of the peripheral he was furtively gauging the reactions of the Ma Family young master. "I have the money, so why don't you give me the command token," he said nonchalantly.

source: 江逸眼花缭乱地读着那些小篆字符，心里非常惊讶，这些黑色的小篆体文字在整体旋转之余，竟然还以自身为中心上下翻转游动着，就如小蝌蚪一般，充满生命的气息。
en_us: Jiang Yi tried to read the tiny, dazzling words, yet could not help but feel shocked and awed by the scene before him. Besides spinning around his body, the tiny script was able to move around freely like little tadpoles filled with the energy of life.

source: 江逸瞬间调集出一丝黑色元力，朝左眼角运转而去，对付江松这种铸鼎界二重的纨绔子弟，他都不屑调集黑色元力增幅攻击力量。当然他也不想让太多人知道，他力量能暴增的事情，比武技？这江松还差远了！
en_us: Jiang Yi hastily assembled a strand of black essence force, releasing the power in the direction of where his left eye was looking. To defeat a wastrel descendant at a second level of the Cast Tripod Realm like Jiang Song, he thought it was not worth it to assemble more black essence force and increase his own attack power. Of course, he did not want to let too many people know of his condition that he could greatly increase his power. Comparing martial arts prowess? Jiang Song's level was far worse than his own!

source: 江逸破门而入，自然惊动了房间内的壮汉，那壮汉本能的一惊，不过看到江逸破空而来的拳头却冷笑起来：“铸鼎境一重也敢来这放肆？找死！”
en_us: The man was naturally startled when Jiang Yi slammed through the door. Overcoming his initial shock, he sneered when he saw Jiang Yi's punch tearing through the air. "How dare a first-stage Cast Tripod Realm brat be so presumptuous? Are you sick of living!?"

source: 江逸确定对方不再变招后，双手瞬间化掌为爪，轻松提前抓住对方的手腕，脚步朝旁边一滑，双手牵引对方朝另外一边攻去，身体一下转到了翊龙宇身后。
en_us: Jiang Yi ascertained that his opponent would not change his technique, before springing into action. Hands posing into claws, he deftly grabbed Yi Longyu's wrists and sidestepped, hands pulling the man in the other direction, dissolving the attack while moving behind Yi Longyu in the same breath.

source: 江逸神情冰冷，脸色没有一丝变化，听到江如虎的话语，他双手将江如虎狠狠抡了一个圈，然后重重的砸在地面……
en_us: Jiang Yi's facial expressions remained ice-cold without a shred of change, as he heard Jiang Ruhu's cries of warning. Both his hands ruthlessly swung Jiang Ruhu around in a circle, before heavily smashing him onto the ground...

source: 江逸神色冷峻，双手依旧缠住江松，还微微用力让他完全不能控制身体重心，双腿如电般朝江松的右腿连续抽去，而且还单独对着小腿处穷追猛打……
en_us: Jiang Yi's expression turned grave, but his hands still continued to entangle Jiang Song. He had even applied some slight force to make him completely unable to control the center of gravity of his body. His legs continued to hit Jiang Song's right leg non-stop like bolts of electricity. He aimed specifically at his lower leg...

source: 江逸突然再次变招，如此近的距离马飞自然躲避不了，轻松被他抓住手腕。江逸手一用力一扭，马飞的腕骨立即一痛，痛哼一声，再也控制不住那把青色短剑。
en_us: Jiang Yi abruptly changed his technique again. At such close proximity, it was impossible for Ma Fei to dodge the attack and his wrist was easily captured. Jiang Yi applied force and twisted hard, causing immediate pain to shoot up Ma Fei's wrist. Grunting in pain, Ma Fei lost control of the teal-colored short sword.

source: 江逸突然想到一件事情，心神一荡，黑色元力增幅药力和可以直接快速疗伤，那可是两回事。如果是后者，那就变态了！他以后受伤了完全都不必借助于疗伤丹药了……
en_us: Jiang Yi suddenly thought of something and his heart skipped a beat. It was two separate matters altogether between the black essence force increasing the strength of the medical effects and being able to directly speed up the healing process. If it were the latter, how obscene powerful would that be! In the future, he would no longer have to heal his wounds with the help of healing elixirs...

source: 江逸突然想到一件事，从怀中取出一块令牌递给江小奴道：“小奴，你看这是什么？”
en_us: It dawned on Jiang Yi to retrieve the command token from his chest pocket and showed it to her, "Xiaonu, look what I've got?"

source: 江逸突然想到了什么，猛地透过院子朝远处看去，外面的景物同样清晰得吓人，就连数十丈外空中飞过一只蚊子都能看清楚轨迹。
en_us: Jiang Yi thought of something suddenly. He looked abruptly into the distance across the yard. Similarly, the scene outside was just shockingly vivid. He could very clearly see the trajectory of a mosquito flying in the distance hundreds of feet away.

source: 江逸突然想起一件事，暗道不妙，他的黑色元力好像也是元力？也在丹田内？既然元力被封印了，这黑色元力自然也会被封印啊？没有黑色元力，他的下场就只能和刚才那两人一样，被活活打得半死踹飞出去……
en_us: Jiang Yi suddenly thought of something and muttered to himself that something was amiss. Was his black essence force not a type of black essence force too? Was it not within his dantian? Since essence force was sealed off from use, would his black essence force naturally be sealed off as well? Without any black essence force, he had no other result beyond ending up in a condition similar to those two persons before him: being simply beaten half to death, and sent flying out with a kick...

source: 江逸立即调集一丝黑色元力，再次运转到伤口附近和药力融合起来，快速治疗伤势。
en_us: Jiang Yi immediately summoned a strand of black essence force, before once again sending it near the wound area, to amalgamate with the medicinal power and speed up the wound-healing process.

source: 江逸站了一会，那柳长老还是无视他，只好咬牙拱手道：“我想领一枚黄参丹和元力丹……”
en_us: Jiang Yi stood for a while, but Elder Liu continued to ignore him. He had no choice but to grit his teeth, cup his hands and say, "I would like to acquire a pill each of Yellow Ginseng Elixir and Essence Force Elixir..."

source: 江逸站了起来拍了拍衣袍，淡淡一笑道：“小姐很厉害了，如此年纪已经是铸鼎境四重，如果不是元力封印，我一招都会被你打趴下。”
en_us: Jiang Yi stood up and patted his robes, before giving a faint smile. He said, "Young Mistress, you are so powerful, your power level is already at the fourth stage of the Cast Tripod Realm even though you're so young. If not for your essence forces being sealed off from use, I would probably have been beaten down by you and lost the match before I can even use a single technique."

source: 江逸站在药田田梗上，望着药田内密密麻麻的绿色草参叶子，脸上一阵苦涩，他昨日就是在这被殴打昏迷，好不容易才挨回家的……
en_us: Jiang Yi stood at the boundary of the fields, staring into the verdant green of the grass ginseng. A sense of bitter agony filled his mind—after all, this was the place where he was beaten up and left unconscious. After regaining consciousness he had to endure with much difficulty and agony the journey home.

source: 江逸站起来迎了上去，那江松却做了个嘘声的动作，凑过来有些疑惑低声问道：“江逸，你怎么在炼药房？长老有没有在里面？”
en_us: Jiang Yi stood up to greet him, but Jiang Song made a hand gesture asking him to keep quiet, before moving closer to him. "Jiang Yi," he asked in a low voice, "what are you doing in the alchemy lab? Is the elder inside?"

source: 江逸第一次来这种大地方，有些不知道如何是好。好在他站了一会，一名穿着管事袍子的中年人就走过来询问道：“请问这位客人有什么需要吗？”
en_us: This was the first time Jiang Yi had visited such a large place; as such, he did not know what to do. After standing at the same spot for a long while, a middle-aged man wearing a managerial robe walked over to him and inquired, "My dear guest, how may I be of assistance?"

source: 江逸精神一震，连忙说道：“十两紫金。”
en_us: Jiang Yi's spirit jolted with excitement as he promptly replied, "Ten taels of purple gold."

source: 江逸纳闷了，闭上眼睛内视丹田，观察剩下的唯一一缕黑色元力，但观察了很久还是一无所获。
en_us: Jiang Yi was puzzled. Closing his eyes and using his inner vision to look into his dantian, he observed the one and only wisp of black essence force left in his body. However, he acquired no new knowledge, despite observing it for a very long time.

source: 江逸细细感知了半天，摇了摇，又掐了掐脑袋，在确认黑色小字应该不具备危险性后，终于长吁了一口气，多年来的压抑生活，让他的心理承受能力远超同龄人。
en_us: Jiang Yi lay on the bed deep in thought for a while. After a moment, he shook his body, then pinched his head. When he confirmed that those tiny black words were probably not harmful to his well-being, he finally heaved a long sigh of relief. Many years of oppression in a depressive life had conditioned his spirit. His ability to endure more stress was greater than that of most other people of his age.

source: 江逸绷紧的心立即放松了一大半，等一名护卫从房间内取出一枚令牌后，他的心完全放了下来，从怀中取出十片紫金叶子朝管事递过去。
en_us: At once, Jiang Yi's highly-strung nerves relaxed almost completely. By the time the guard came in with the retrieved command token, he was entirely at ease and reached into his chest pocket to hand over ten pieces of purple gold leaf to the housekeeper.

source: 江逸缩了缩头，暗道这柳长老果然是个怪人，刚才还满脸狂喜，这说翻脸就翻脸了……
en_us: Jiang Yi retracted his head, thinking to himself silently that this Elder Liu was no doubt a weird man—just moments before he was all smiles, yet instantly he could become hostile...

source: 江逸老老实实的拱手道：“回荣管事，还没……”
en_us: Jiang Yi sincerely cupped his hands and said, "Chief Rong, not yet—"

source: 江逸耸了耸肩，走出去继续回去修炼，然而……只是半个时辰后他又被杨管事叫了出来，这次还是有人点名要他陪练。
en_us: Jiang Yi shrugged and went back to his cultivation. However... he was summoned again by Manager Yang an hour later, as another guest had requested his service.

source: 江逸脚刚刚落地，身子又猛然在地面一踏跃空而起，单腿重重的抬起对着江松一条腿重重劈下。
en_us: Just as Jiang Yi landed, his body vigorously jumped into the air again. He raised one of his leg and swung it down at Jiang Song.

source: 江逸脸上一片冷意，身子如猎豹般朝马公子和刘管事冲去，根本不惧漫天的粉末。他哪有什么毒粉？刚才那黑呼呼的东西是江小奴给他准备的干肉……
en_us: There was nothing but a look of ruthlessness on Jiang Yi's face. He charged at Young Master Ma and Housekeeper Liu as fast as a cheetah, completely undeterred by the powder filling the air - for how could he possess such a thing as poison powder? The black substance was actually just the jerky that Xiaonu prepared for him...

source: 江逸脸上没有半点慌乱，面对家族的武堂的长老，江家战力排行第三的强者依旧不亢不卑，他沉声拱手说道：“这些人全部是我伤的，去刑堂可以，我也可以认罪。不过我请求家族所有长老在旁边听审，否则……我死也不去刑堂，还请长老亲手杀了江逸吧！”
en_us: Jiang Yi's face didn't have an hint of frenetic, even with facing the clan's Martial Court Elder. He spoke with a neither overbearing nor servile to the clan's overall no.3 combatant, "All these people are injured by me. I will go to the Disciplinary Court and I will admit my mistakes too. But I beg for all the clan's Elders to be at the hearing. If not... I would rather die than go to the Disciplinary Court. I beg for Elder to personally execute Jiang Yi!"

source: 江逸脸色一变，荣管事给他的令牌他可是拿给风月楼抵押了，此刻拿什么上交啊？
en_us: Jiang Yi's face changed. The command token that Chief Rong gave him was now impawned by the people at the Fengyue Brothel. What could he possibly hand up to Chief Rong at that moment?

source: 江逸脸色一沉，暗道如果自己有铸鼎境二重配合黑色元力的话，绝对要把那群人打得屁滚尿流，可惜这黑色元力有很多神奇功能，就是不能辅助修炼……
en_us: Jiang Yi's heart sunk. If only my power level was at the second stage of the Cast Tripod Realm... Should he combine that power with black essence force, he could definitely beat that group of people to a pulp. Unfortunately for all the magical powers of this black essence force, it just could not be used to accelerate his essence force refinement...

source: 江逸脸色完全沉了下来，从牙缝内蹦出几个字：“多少？”
en_us: Jiang Yi's expression had darkened completely. He forced two words past his teeth: "How much?"

source: 江逸脸色沉了下来，他眸子转动几圈，沉吟片刻咬牙道：“小奴，你乖乖呆在家，我先出去一趟。”
en_us: Jiang Yi's face darkened. Rolling his pupils about for several rounds, he sighed deeply for a short moment, gritted his teeth, and said, "Xiaonu, you stay at home obediently. I'll be heading out for a while first."

source: 江逸苍狼面具之下的双眼光芒一闪，沉声问道：“交易？”
en_us: Under his wolf mask, Jiang Yi's eyes lit up. He asked in a low voice, "A deal?"

source: 江逸苦恼的抓着脑袋，不过很快就将不知足的烦恼抛在一边，又兴奋的站起来，输送黑色元力到右拳和江水诀蓝色元力融合，右拳对着地面的青石板再次砸去。
en_us: Jiang Yi scratched his head, vexed, but he quickly pushed aside his frustrations. He stood up again and transferred the black essence force to his right fist to fuse with the Jiang Water Art's blue essence force once again. He smashed his right fist onto the limestone slab on the floor.

source: 江逸苦涩一笑，想起年少时，两人一起学习武技的情景，那时候江恨水总是对他不服气，经常一起比试，两人关系还算不错。不过后来因为江逸被查出丹田被封印，加上大长老的失踪，两人才越来越疏远，距离上次见面都有两三年了，江恨水一时之间没认出他也正常。
en_us: Jiang Yi bitterly smiled as he thought about the time when he was younger and the scenes when the two of them practiced martial arts together. At the time, Jiang Henshui was never satisfied with their difference in skills and thus they regularly sparred against each other. As such, the relationship between the two boys could be considered to be pretty good. However, with the revelation that Jiang Yi's dantian was sealed, coupled with the disappearance of the Grand Elder, the two of them became increasingly estranged. The last time they met had been two to three years ago. As such, it was not out of the ordinary that Jiang Henshui could not recognize him instantly.

source: 江逸苦涩的笑了笑，那日他在聚珍阁就是化名易剑。不过被认出来了，他心里反而没那么别扭了，目光平静的望着姬听雨问道：“姬小姐，你是怎么认出我来的？那日你并没有看到我的眼睛吧？”
en_us: Jiang Yi smiled with some bitter agony. That day, he had used that pseudonym "Yi Jian" at the Pearl Gathering Pavilion. However, after being so easily and quickly recognised, his heart did not feel so wrung and pained as before. Instead, he looked at Ji Tingyu with a tranquil gaze and asked, "Young Mistress Ji, how did you recognise me? You did not see my eyes that day, did you?"

source: 江逸苦笑，他身上倒是有十枚灵神丹，不过才是刚买的……好在整张脸笼罩在斗篷内，刘管事看不到他的神情，他起身拱手道：“刘管事，在下想见一下你们小姐，有一事相求！”
en_us: Jiang Yi laughed bitterly. He did actually have ten Spirit Pills on his person, but he'd just purchased them. Thankfully for him, his entire face was shrouded within his cloak and as such, Housekeeper Liu could not see his expression. He stood up and cupped his hands. "Housekeeper Liu, I would like to meet your young mistress. I have something to ask of her!"

source: 江逸苦笑：“姬小姐，我这个人不喜欢麻烦，喜欢平静一些的生活……”
en_us: Jiang Yi smiled bitterly, "Young Mistress Ji, I don't like disturbances. I prefer to a more peaceful life..."

source: 江逸虽然修行效果受到封印限制，效果颇微，但每次修行的时候都是很认真，全神贯注的。但这一次不知为什么明显有些心不在焉，好几次将气血运行错了线路，幸好及时纠正才没走火入魔。然而他脑海中的几十个黑色文字总在他的眼前晃来晃去，让他静不下心来。
en_us: Although the effects of the martial arts practice were severely limited by the magical seal, Jiang Yi still took his essence force training very seriously and concentrated all his attention on practicing. However, preoccupied with other thoughts, he had accidentally transferred his blood down the wrong circulatory route a number of times. He was lucky he was able to rectify the error before he suffered from deviated Qi. Nonetheless, he was distracted by the black script in his mind that kept swaying and moving about in front of his vision. It left him unable to calm down.

source: 江逸虽然元力不足，但对于武技的掌控却是异常纯熟，既然下了决心要收拾对方，怎容江豹躲避？便将蛇鞭腿淋漓尽致地发挥出来，两条长腿便如毒蛇附骨一般，一次次扫在江豹的后背上。
en_us: Jiang Yi had little essence force, but he was highly skilled at utilizing various techniques. Since he had already made up his mind to get rid of him, how could he let Jiang Bao escape? Jiang Yi pushed the Snake Whip Leg to its full potential, and his legs shot out like two ferocious snakes, sweeping across Jiang Bao's back, again and again.

source: 江逸被吓到了，连忙站了起来，摇头道：“不是，不是！我只是帮别人来卖丹的…”
en_us: Jiang Yi was taken aback. He hurriedly stood up and, shaking his head, he answered, "No, no! I am just selling the elixir on someone else's behalf..."

source: 江逸被震住了，低头沉吟不语，去翊家肯定不可能的，不说他和武殿有协议，就算给江家知道了他也难逃一死，这可是叛族啊。
en_us: Jiang Yi was in awe. He mulled with his head lowered. Joining the Yi Family was out of the question; to say nothing of the agreement he had with the Martial Arts Hall, death would be an inevitable end if the Jiang Clan found out, it was an act of treachery against the family clan after all.

source: 江逸要的就是这种效果！
en_us: That outcome was exactly what Jiang Yi wanted!

source: 江逸见姬听雨不说话盯着他直看，一双漂亮的丹凤眼内都是迷蒙之色，又尴尬起来随口说道：“姬小姐，既然你找我陪练，那就打一场吧，不过还望手下留情哦。”
en_us: Seeing Ji Tingyu continuously stare at him in silence, with her pair of pretty phoenix eyes giving off a misty look, he felt awkward once again and as such quickly opened his mouth to say, "Young Mistress Ji, since you came searching for me for a practice match, how about we spar against each other in a match now? I hope that you please be merciful to me."

source: 江逸讪讪摸了摸头，他要是还手的话，这翊小姐元力被封印怕是一招就要被他撂倒了，不过此刻他能说什么？只能点了点头道：“好！”
en_us: Embarrassed, Jiang Yi scratched his head. If he retaliated against her moves, with her essence forces sealed off, he was afraid that with a single move he would knock her down. However, what else could he say at that moment? He had no choice but to nod and reply, "Alright!"

source: 江逸讪讪的摸了摸鼻子，走了出来，一拱手道：“江逸拜见柳长老，我……不是江松，我是来领丹药的。”
en_us: Jiang Yi awkwardly scratched his nose, walked out from where he was hiding, and cupped his hands as he greeted, "Greetings, Elder Liu. I... am not Jiang Song. I, Jiang Yi, am here to retrieve elixirs."

source: 江逸讪讪的站立，回了一句：“我不躲避，难道站着给你打？陪练又不是给人出气挨揍的……”
en_us: Jiang Yi stood still abashedly and retorted, "Should I not have dodged and let you hit me? Sparring partners are not punching bags for people to vent their anger on..."

source: 江逸讪讪的笑了笑，也不用这黑甲护卫带路了，径直进了武殿朝练功房那边走去。
en_us: Jiang Yi smiled, embarrassed. Not needing this guard clad in black armour to lead the way, he directly walked into the Martial Arts Hall and went straight towards the Technique Practising Room.

source: 江逸走后一柱香时间，练功房走廊内一道火红色身影就风风火火冲了过来，一走到大殿内立即在所有陪练脸上的面具上扫了一圈，很是急迫的问道：“杨管事，刚才和我对练的那个金牌陪练呢？”
en_us: Five minutes after Jiang Yi left, a fiery-red figure rushed over energetically through the corridor of the technique practising rooms. Upon walking into the central hall, the person immediately gazed around at the masks worn by all the sparring partners before, with much urgency, asking, "Manager Yang, where is that gold token-grade sparring partner whom I was practising with just now?"
